eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеОСвАренду/абс_ПоступлениеОСвАренду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПоступлениеОСвАренду</name>
  <registerRecords>AccountingRegister.ЗабалансовыйУчет</registerRecords>
  <attributes>
    <name>ВидЦенностей</name>
    <type>
      <types>EnumRef.абс_ВидыЦенностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВхНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.АБС_ДобСегмент</types>
      </type>
    </attributes>
    <attributes>
      <name>ОборудованиеЕМЦСС</name>
      <type>
        <types>CatalogRef.АБС_ДобОборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>АрендованноеОС</name>
      <type>
        <types>CatalogRef.АБС_ОСАрендованные</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОС</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.ЗабалансовыйУчет</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccountingRegisters/ЗабалансовыйУчет/ЗабалансовыйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЗабалансовыйУчет</name>
  <chartOfAccounts>ChartOfAccounts.ЗабалансовыйУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ЗабалансовыйУчет.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ЗабалансовыйУчет.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.ЗабалансовыйУчет.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/Enums/абс_ВидыЦенностей/абс_ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыЦенностей</name>
  <enumValues>
    <name>ОС_ЕМЦСС</name>
  </enumValues>
  <enumValues>
    <name>ОС_Аренда</name>
  </enumValues>
  <enumValues>
    <name>ОС_Хранение</name>
  </enumValues>
  <enumValues>
    <name>ОС_Лизинг</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеОСвАренду/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ
Перем Счет;
Перем Содержание;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

//Функция осуществляет проверку реквизитов шапки документа
//
Функция ПроверитьШапкуДокумента()
	
	Если ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_ЕМЦСС Тогда
		
		Счет = ПланыСчетов.ЗабалансовыйУчет.СегментСетиЕМЦССМПСРФ;
		Содержание = "Поступление ОС в составе ЕМЦСС, получ.по экспл.соглашению, принадл. РЖД";
		
	ИначеЕсли (ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Аренда) 
		ИЛИ (ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Хранение) Тогда
		
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Сообщить("Не указан сотрудник");
			Возврат Истина;	
		КонецЕсли;	
		
		Если ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Аренда Тогда
			
			Счет =  ПланыСчетов.ЗабалансовыйУчет.АрендованныеОС;
			Содержание = "Поступление ОС полученных в аренду";
			
		ИначеЕсли ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Хранение Тогда
			
			Счет = ПланыСчетов.ЗабалансовыйУчет.ОСНаОтветХранении;
			Содержание = "Поступление ОС полученных в эксплуатацию или ответхранение";
			
		КонецЕсли;
	ИначеЕсли ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Лизинг Тогда
		
		    Счет = ПланыСчетов.ЗабалансовыйУчет.ЛизинговоеИмущество;//СчетПоКоду("001.6");
			Содержание = "Поступление ОС полученных в лизинг";
			
	Иначе
		Сообщить("Ошибка в реквизите ""Вид полученных ценностей""");
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

// Функция осуществляет проверку реквизитов табличной части "ОС" документа
//
Функция ПроверитьТабличнуюЧасть()
	
	ЕстьОшибки = Ложь;
	
	Для Каждого СтрокаТабличнойЧасти Из ОС Цикл
		
		//АБС+
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Счет) И Счет = ПланыСчетов.ЗабалансовыйУчет.ПустаяСсылка() Тогда
			Сообщить("В строке №"+СтрокаТабличнойЧасти.НомерСтроки +" не указан счет учета"+Символы.ПС);
			ЕстьОшибки = Истина;
		КонецЕсли;
		//АБС-
		
		Если ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_ЕМЦСС Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сегмент) Тогда
				Сообщить("В строке №"+СтрокаТабличнойЧасти.НомерСтроки +" не указан Сегмент"+Символы.ПС);
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ОборудованиеЕМЦСС) Тогда
				Сообщить("В строке №"+СтрокаТабличнойЧасти.НомерСтроки +" не указан ОборудованиеЕМЦСС"+Символы.ПС);
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.МестоХранения) Тогда
				Сообщить("В строке №"+СтрокаТабличнойЧасти.НомерСтроки +" не указано место хранения"+Символы.ПС);
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			
		ИначеЕсли (ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Аренда) 
			ИЛИ (ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Хранение) Тогда
			
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.АрендованноеОС) Тогда
				Сообщить("В строке №"+СтрокаТабличнойЧасти.НомерСтроки +" не указано арендованное ОС"+Символы.ПС);
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			
		ИначеЕсли ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Лизинг Тогда
			
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ОС) Тогда
				Сообщить("В строке №"+СтрокаТабличнойЧасти.НомерСтроки +" не указано ОС"+Символы.ПС);
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Оборудование) Тогда
				Сообщить("В строке №"+СтрокаТабличнойЧасти.НомерСтроки +" не указано Оборудование"+Символы.ПС);
				ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьОшибки;
	
КонецФункции

//АБС+
Функция ЗаполнитьСчетУчетаВТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт 
	
	Если ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_ЕМЦСС Тогда
		
		СтрокаТабличнойЧасти.Счет = ПланыСчетов.ЗабалансовыйУчет.СегментСетиЕМЦССМПСРФ;
		
	ИначеЕсли ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Аренда Тогда
		
		СтрокаТабличнойЧасти.Счет =  ПланыСчетов.ЗабалансовыйУчет.АрендованныеОС;
		
	ИначеЕсли ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Хранение Тогда
		
		СтрокаТабличнойЧасти.Счет = ПланыСчетов.ЗабалансовыйУчет.ОСНаОтветХранении;
		
	ИначеЕсли ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Лизинг Тогда
		
		СтрокаТабличнойЧасти.Счет = ПланыСчетов.ЗабалансовыйУчет.ЛизинговоеИмущество;//СчетПоКоду("001.6");
		
	КонецЕсли;
	
КонецФункции
//АБС-

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура - обработчик события "Обработка проведения" 
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	Отказ = ПроверитьШапкуДокумента();
	
	Если Не Отказ Тогда
		Отказ = ПроверитьТабличнуюЧасть();
	КонецЕсли;
	
	Если Не Отказ Тогда	
		Для Каждого СтрокаОС Из ОС Цикл
				
				Движение = Движения.ЗабалансовыйУчет.Добавить();
				Движение.ДатаЗаписи   = Дата;
				Движение.Организация  = Организация;
				Движение.Период       = Дата;
				Движение.СчетДт       = ?(ЗначениеЗаполнено(СтрокаОС.Счет), СтрокаОС.Счет, Счет);   //АБС+
				Движение.Регистратор  = Ссылка;
				Движение.КоличествоДт = СтрокаОС.Количество;
				Движение.Сумма        = СтрокаОС.Сумма;
				Движение.Содержание   = Содержание;
				
			Если ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_ЕМЦСС Тогда
				
				Движение.СубконтоДт.АБС_ДобСегмент = СтрокаОС.Сегмент;
				Движение.СубконтоДт.АБС_ДобОборудование = СтрокаОС.ОборудованиеЕМЦСС;
				Движение.СубконтоДт.Склады = СтрокаОС.МестоХранения;
				
			ИначеЕсли ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Аренда ИЛИ
				ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Хранение Тогда
				
				Движение.СубконтоДт.АБС_ОСАрендованные = СтрокаОС.АрендованноеОС;
				Движение.СубконтоДт.РаботникиОрганизации = Сотрудник;
				Движение.СубконтоДт.Контрагенты = Поставщик;
				
				
			ИначеЕсли	ВидЦенностей = Перечисления.абс_ВидыЦенностей.ОС_Лизинг Тогда
				
				Движение.СубконтоДт.Номенклатура = СтрокаОС.Оборудование;
				Движение.СубконтоДт.ОсновныеСредства = СтрокаОС.ОС;
				Движение.СубконтоДт.Контрагенты = Поставщик;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура  - обработчик события "Перед записью"
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
   
	 
	мУдалятьДвижения = НЕ ЭтоНовый();

	СуммаДокумента = ОС.Итог("Сумма");
	
КонецПроцедуры  // ПередЗаписью

Счет = ПланыСчетов.ЗабалансовыйУчет.ПустаяСсылка();
Содержание = "";
